{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hi",
        "Hey",
        "How are you",
        "Is anyone there?",
        "Hello",
        "Good day",
        "I'm fine. How about you?",
        "I'm pretty good. Thanks for asking.",
        "Everything's been good with you?",
        "I haven't been better. How about yourself?",
        "I'm doing great. What about you?",
        "I'm actually driving.",
        "I've actually been pretty good. i don't think You?",
        "I've been great. What about you?",
        "I'm pretty good. I'm in class right now."
      ],
      "responses": [
        "Hey :-)",
        "Hello, thanks for visiting",
        "Hi there, what can I do for you?",
        "Hi there, how can I help?",
        "Glad to see you",
        "Hiya! How are you?",
        "Hey there! What's up?",
        "Hey! How's your day going?",
        "Hello! How can I assist you today?",
        "Hi! Nice to meet you.",
        "Hello, friend! How can I help you?",
        "Hey! How have you been lately?",
        "Hello! How's everything going?",
        "Hey! What's new?",
        "Alright",
        "Hi there! How have you been?",
        "Hello! How's your week been?",
        "Hey! my friend how can I help you"
      ]
    },
        {
          "tag": "greeting",
          "patterns": [
            "What is your name?"
          ],
          "responses": [
           "My name is አዋቂ"
          ]
        },
    {
      "tag": "farewell",
      "patterns": [
        "Bye",
        "See you later",
        "Goodbye",
        "Take care",
        "Have a good one",
        "Catch you later",
        "Until next time",
        "So long",
        "Farewell for now",
        "Goodnight",
        "May God help you"
      ],
      "responses": [
        "See you later, thanks for visiting",
        "Have a nice day",
        "Bye! Come back again soon.",
        "Goodbye! Have a great day!",
        "See you later, alligator!",
        "Until next time! Farewell!",
        "Catch you later, alligator!",
        "So long, farewell!",
        "Farewell for now! Take care!",
        "Goodnight! Sleep well!",
        "Have sweet life",
        "Wish you long life"
      ]
    },
    {
      "tag": "thanking",
      "patterns": [
        "Thanks",
        "Thank you",
        "Appreciate it",
        "Grateful",
        "Thanks a bunch",
        "You're awesome",
        "Much obliged",
        "I owe you one"
      ],
      "responses": [
        "Happy to help! Any time! My pleasure.",
        "You're welcome! Glad I could assist.",
        "It's my pleasure to assist you!",
        "Glad I could be of assistance! Let me know if you need anything else.",
        "You're welcome! Don't hesitate to ask if you need more help.",
        "Anytime! Helping you is what I'm here for.",
        "No worries! Helping you out is my pleasure."
      ]
    },
    {
      "tag": "question_about_bot",
      "patterns": [
        "Who are you?",
        "Are you a robot?",
        "What can you do?",
        "How were you created?",
        "Are you a chatbot?"
      ],
      "responses": [
        "I'm an AI-powered chatbot here to help!",
        "I'm a virtual assistant programmed to answer your questions!",
        "I'm your friendly virtual assistant ready to help you!",
        "I'm an AI-based chatbot programmed to provide assistance!",
        "I'm a chatbot created to make your life easier!",
        "I'm a digital assistant available to assist you 24/7!"
      ]
    },
    {
      "tag": "personal_information",
      "patterns": [
        "How old are you?",
        "Where are you from?",
        "Tell me about yourself",
        "Are you married?",
        "Are you single?",
        "What do you like to do?",
        "What are your hobbies?",
        "What are your interests?",
        "What are your skills?",
        "What's your favorite book?"
      ],
      "responses": [
        "I'm ageless and timeless!",
        "I exist in the digital realm!",
        "As an AI, I don't experience human relationships like family or friends.",
        "I'm married to technology! 😄",
        "I'm single and ready to mingle...with data!",
        "I enjoy assisting users like you!",
        "My hobbies include processing data and assisting users!",
        "I'm interested in helping you with your questions and tasks!",
        "I love all books that expand my knowledge and understanding!"
      ]
    },{
      "tag": "small_talk",
      "patterns": [
        "How's the weather?",
        "What's up?",
        "How's it going?",
        "What's new?",
        "How are you feeling?",
        "What have you been up to?",
        "How's everything?",
        "What's on your mind?",
        "What's the latest?"
        ],
      "responses": [
        "The weather is fine, thank you!",
        "Not much, just here to assist you!",
        "I'm doing well, thanks for asking!",
        "Not too much, just helping users like you!",
        "Feeling good and ready to assist you!",
        "Life is good! How can I assist you today?",
        "Just busy assisting users like you!",
        "Everything is going smoothly, thank you!",
        "My virtual mind is always busy!",
        "The latest news is always at your fingertips!"
      ]
    },{
      "tag": "hobbies_interests",
      "patterns": [
        "What are you interested in?",
        "Do you have any hobbies?",
        "What are your passions?",
        "What do you like to do for fun?",
        "Tell me about your interests",
        "What do you do in your free time?"
      ],
      "responses": [
        "I enjoy learning new things and helping users!",
        "My interests revolve around helping you with your queries!",
        "I'm fascinated by technology and helping users like you!",
        "I'm interested in all things related to assisting users!",
        "My favorite pastime is answering questions and providing information!",
        "In my free time, I'm here to assist you with any questions you have!"
      ]
    },{
      "tag": "movies_tv_shows",
      "patterns": [
        "What's the best movie you've seen?",
        "Recommend me a good movie",
        "What's a popular TV show?",
        "Any favorite actors?",
        "Do you watch Netflix?",
        "What genre of movies do you prefer?"
      ],
      "responses": [
        "I'm always up for suggesting a good movie or TV show!",
        "I can suggest movies based on your preferences!",
        "Netflix has a wide range of content to choose from!",
        "I can provide recommendations based on your favorite genres!",
        "Feel free to ask for recommendations anytime!",
        "Let me know your preferences, and I'll suggest something you might like!"
      ]
    },
    {
      "tag": "books_literature",
      "patterns": [
        "What's your favorite book?",
        "What's the best book you've read?",
        "Recommend me a good book",
        "Have you read any classics?"
      ],
      "responses": [
        "As a chatbot, I don't read books, but I can suggest some popular ones!",
        "There are countless amazing books out there! Let me suggest a few.",
        "I don't have personal favorites, but I can suggest books based on your taste!",
        "I can provide recommendations tailored to your reading preferences!"
      ]
    },
    {
      "tag": "food_cuisine",
      "patterns": [
        "Recommend me a good restaurant",
        "What cuisine do you prefer?",
        "Have you tried any exotic foods?",
        "What's a popular food dish?",
        "Do you have any dietary preferences?",
        "Do you like trying new foods?"
      ],
      "responses": [

        "I don't have personal favorites, but I can suggest dishes based on your taste!",
        "Feel free to ask for restaurant recommendations anytime!",
        "I can provide recommendations tailored to your culinary preferences!",
        "Exploring exotic foods can be a delightful experience!",
        "Let me know your dietary restrictions, and I'll suggest something you might like!",
        "I'm here to help you discover new flavors and cuisines!"
      ]
    },
    {
      "tag": "travel",
      "patterns": [
        "What's the best place you've visited?",
        "Recommend me a good travel destination",
        "What type of travel do you prefer? (e.g., beach, city, adventure)",
        "Have you been on any memorable trips?",
        "What's a popular tourist attraction?",
        "Do you have any travel plans?",
        "Do you like exploring new places?"
      ],
      "responses": [
        "Traveling is an enriching experience! Let me suggest some amazing destinations.",
        "I don't have personal favorites, but I can suggest destinations based on your interests!",
        "Feel free to ask for travel recommendations anytime!",
        "I can provide recommendations tailored to your travel preferences!",
        "Exploring new places can create unforgettable memories!",
        "Let me know your travel interests, and I'll suggest something you might like!",
        "I'm here to help you discover new travel destinations and experiences!"
      ]
    },
    {
      "tag": "education",
      "patterns": [
        "What's your favorite subject?",
        "Do you enjoy learning?",
        "What's the best course you've taken?",
        "Recommend me a good educational platform",
        "Have you learned anything interesting lately?",
        "What's a popular educational trend?",
        "Do you enjoy studying?"
      ],
      "responses": [
        "As a chatbot, I'm always eager to learn!",
        "I can recommend educational resources and courses based on your interests!",
        "Education is the key to growth and development! Let me suggest some valuable learning materials.",
        "Feel free to ask for educational recommendations anytime!",
        "I can provide recommendations tailored to your educational interests!",
        "Exploring new subjects and courses can be enlightening!",
        "I'm here to help you expand your knowledge and skills through education!"
      ]
    },{
      "tag": "work_career",
      "patterns": [
        "What's your dream job?",
        "Do you enjoy working?",
        "Any favorite companies or industries?",
        "What's the best job you've had?",
        "Recommend me a good career development resource",
        "What field of work do you prefer?",
        "Have you learned any valuable career skills?",
        "What's a popular career trend?",
        "Do you have any career aspirations?",
        "Do you enjoy your job?"
      ],
      "responses": [
        "As a chatbot, I'm passionate about assisting users!",
        "I can recommend career development resources based on your interests!",
        "Career growth is essential for personal and professional success! Let me suggest some valuable resources.",
        "I don't have personal preferences, but I can suggest career development platforms based on your preferences!",
        "Feel free to ask for career recommendations anytime!",
        "I can provide recommendations tailored to your career interests!",
        "Gaining new career skills can open doors to exciting opportunities!",
        "Let me know your career aspirations, and I'll suggest something you might find helpful!",
        "I'm here to support you in achieving your career goals!"
      ]
    },
    {
      "tag": "sports",
      "patterns": [
        "What's your favorite sport?",
        "Do you enjoy playing sports?",
        "Any favorite sports teams?",
        "What's the best sports event you've watched?",
        "Recommend me a good sports game to watch",
        "What type of sports do you prefer?",
        "Have you participated in any sports competitions?",
        "What's a popular sports trend?",
        "Do you have any sports goals?",
        "Do you enjoy watching sports?"
      ],
      "responses": [
        "As a chatbot, I don't play sports, but I can suggest some popular sports and teams!",
        "I can recommend sports games and events based on your interests!",
        "Sports are a great way to stay active and connected! Let me suggest some exciting events.",
        "I don't have personal favorites, but I can suggest sports events based on your preferences!",
        "Feel free to ask for sports recommendations anytime!",
        "I can provide recommendations tailored to your sports interests!",
        "Participating in sports competitions can be exhilarating!",
        "Let me know your sports goals, and I'll suggest something you might find enjoyable!",
        "I'm here to help you stay updated on the latest sports trends and events!"
      ]
    },
    {
      
          "tag": "Health/Fitness",
          "patterns": [
            "Tell me about staying healthy",
            "How can I maintain a healthy lifestyle?",
            "What are some tips for fitness?",
            "Any advice on staying fit?",
            "I want to improve my health",
            "Interested in health and fitness tips",
            "I'm trying to be more health-conscious",
            "What's the best way to stay fit?",
            "Any recommendations for staying healthy?"
          ],
          "responses": [
            "To maintain a healthy lifestyle, focus on a balanced diet, regular exercise, adequate sleep, and stress management.",
            "Staying fit involves eating well, exercising regularly, and taking care of your mental well-being.",
            "To stay healthy, aim for a mix of cardio, strength training, and flexibility exercises, along with nutritious eating habits.",
            "Try to incorporate activities you enjoy into your fitness routine to make it sustainable and fun.",
            "Improving your health starts with small, consistent changes in your daily habits, such as eating more vegetables and moving your body regularly.",
            "Don't forget to celebrate your progress along the way, no matter how small!",
            "Incorporate variety into your workouts to prevent boredom and challenge different muscle groups.",
            "Prioritize sleep as part of your fitness routine, as it's essential for recovery and overall well-being.",
            "Consider consulting a professional, such as a personal trainer or nutritionist, for personalized advice and guidance."
          ]
  
    },
    {
       "tag": "Entertainment",
          "patterns": [
            "Tell me about entertainment options",
            "What are some fun things to do for entertainment?",
            "Looking for entertainment ideas",
            "Recommendations for entertainment?",
            "I'm bored. Any suggestions for entertainment?",
            "What's new in the world of entertainment?",
            "I want to relax with some entertainment. Any ideas?",
            "How do I find good entertainment?",
            "Entertainment recommendations, please!"
          ],
          "responses": [
            "Entertainment options include watching movies, listening to music, reading books, playing games, attending events, and exploring hobbies.",
            "For entertainment, consider going to a concert, visiting a museum, trying out a new restaurant, or attending a live performance.",
            "If you're bored, try watching a comedy special, playing a board game with friends, going for a hike, or trying a new recipe.",
            "Stay updated on the latest movies, TV shows, music releases, and events in your area for a diverse range of entertainment options.",
            "Looking for something low-key? Try a movie marathon, DIY crafts, or a virtual cooking class for some at-home entertainment.",
            "Stay informed about entertainment news and updates through social media, streaming platforms, and online forums.",
            "For relaxation, try activities like meditation, yoga, gardening, or listening to calming music for some self-care entertainment.",
            "To find good entertainment, explore recommendations from friends, family, online reviews, and curated playlists for inspiration.",
            "Seek out entertainment options that align with your interests and preferences, whether it's comedy, drama, action, or romance."
          ]
    },
      {
          "tag": "Relationships",
          "patterns": [
            "Tell me about building relationships",
            "How do I improve my relationships?",
            "Any advice on maintaining relationships?",
            "I want to learn more about relationships",
            "What makes a healthy relationship?",
            "I'm struggling with my relationships. Help?",
            "What are some signs of a toxic relationship?",
            "Any tips for long-distance relationships?",
            "How do I navigate romantic relationships?"
          ],
          "responses": [
            "Building relationships requires trust, communication, respect, and mutual understanding.",
            "To improve relationships, focus on active listening, empathy, compromise, and expressing appreciation for your loved ones.",
            "Maintaining relationships involves regular communication, quality time together, and addressing conflicts openly and respectfully.",
            "Understanding your own needs and boundaries is essential for healthy relationships.",
            "Healthy relationships are characterized by mutual respect, trust, support, and open communication.",
            "If you're struggling with relationships, consider seeking support from a therapist or counselor who can provide guidance and perspective.",
            "Signs of a toxic relationship may include manipulation, lack of trust, disrespect, and emotional or physical abuse.",
            "In long-distance relationships, communication, trust, and finding ways to stay connected are key for maintaining intimacy and closeness.",
            "Navigating romantic relationships involves communication, trust, understanding, and mutual support."
          ]
        
      
    },
    {
      
          "tag": "Emotions/Mood",
          "patterns": [
            "How can I manage my emotions?",
            "Tell me about coping with mood swings",
            "What are some strategies for improving mood?",
            "I want to understand my emotions better",
            "Dealing with stress and anxiety",
            "Advice on managing anger",
            "How do I practice self-care for my emotional well-being?",
            "Tell me about mindfulness techniques",
            "Any suggestions for relaxation techniques?"
          ],
          "responses": [
            "Managing emotions involves recognizing and acknowledging your feelings, practicing self-awareness, and developing healthy coping mechanisms.",
            "Coping with mood swings may involve identifying triggers, practicing stress management techniques, and seeking support from loved ones or a therapist.",
            "Improving mood can be achieved through activities like exercise, spending time outdoors, connecting with others, and engaging in hobbies or activities you enjoy.",
            "Understanding your emotions involves identifying and labeling feelings, exploring their underlying causes, and finding constructive ways to respond.",
            "Dealing with stress and anxiety may involve relaxation techniques, deep breathing exercises, mindfulness practices, and seeking professional support if needed.",
            "Managing anger involves identifying triggers, practicing relaxation techniques, and finding constructive ways to express and release anger.",
            "Practicing self-care for emotional well-being may involve setting boundaries, prioritizing self-care activities, and seeking support when needed.",
            "Mindfulness techniques, such as meditation, deep breathing, and body scans, can help cultivate present-moment awareness and reduce stress.",
            "Relaxation techniques like progressive muscle relaxation, guided imagery, and aromatherapy can promote relaxation and stress relief."
          ]
        
      
    },
    {
      
          "tag": "Jokes/Humor",
          "patterns": [
            "Tell me a joke",
            "I need a laugh",
            "Do you know any funny jokes?",
            "Share something funny",
            "Make me laugh",
            "Entertain me with a joke",
            "I could use some comic relief",
            "What's your favorite joke?",
            "Hit me with your best joke"
          ],
          "responses": [
            "Why don't scientists trust atoms? Because they make up everything!",
            "I told my wife she was drawing her eyebrows too high. She looked surprised.",
            "What do you get when you cross a snowman and a vampire? Frostbite!",
            "Why couldn't the bicycle stand up by itself? It was two-tired!",
            "What's orange and sounds like a parrot? A carrot!",
            "Why did the scarecrow win an award? Because he was outstanding in his field!",
            "I'm on a whiskey diet. I've lost three days already!",
            "Why did the tomato turn red? Because it saw the salad dressing!",
            "Why don't some couples go to the gym? Because some relationships don't work out!"
          ]
       
    },
    {
      
          "tag": "Jokes/Humor",
          "patterns": [
            "Tell me a joke",
            "I need a laugh",
            "Do you know any funny jokes?",
            "Share something funny",
            "Make me laugh",
            "Entertain me with a joke",
            "I could use some comic relief",
            "What's your favorite joke?",
            "Hit me with your best joke",
            "I'm feeling down. Cheer me up!"
          ],
          "responses": [
            "Why don't scientists trust atoms? Because they make up everything!",
            "I told my wife she was drawing her eyebrows too high. She looked surprised.",
            "What do you get when you cross a snowman and a vampire? Frostbite!",
            "Why couldn't the bicycle stand up by itself? It was two-tired!",
            "What's orange and sounds like a parrot? A carrot!",
            "Why did the scarecrow win an award? Because he was outstanding in his field!",
            "I'm on a whiskey diet. I've lost three days already!",
            "Why did the tomato turn red? Because it saw the salad dressing!",
            "Why don't some couples go to the gym? Because some relationships don't work out!",
            "I used to play piano by ear, but now I use my hands!"
          ]
       
    },
    {
      
          "tag": "Advice/Support",
          "patterns": [
            "I need some advice",
            "Can you offer me some guidance?",
            "Looking for support",
            "What should I do?",
            "Any words of wisdom?",
            "Seeking guidance",
            "In need of some support",
            "Can I ask for your opinion?",
            "Dealing with a tough situation"
          ],
          "responses": [
            "Trust your instincts and listen to your heart. You know yourself better than anyone else.",
            "Sometimes the best advice comes from within. Take a moment to reflect on what you truly want.",
            "Seeking support from friends, family, or a therapist can provide valuable insights and perspectives.",
            "When facing a dilemma, weigh the pros and cons, consider the potential outcomes, and follow your intuition.",
            "Remember that it's okay to ask for help when you need it. You don't have to navigate challenges alone.",
            "Practice self-care and prioritize your well-being, especially during times of stress or uncertainty.",
            "Sometimes simply talking about your concerns with someone you trust can provide clarity and reassurance.",
            "Be kind to yourself. You're doing the best you can with the resources you have.",
            "Consider seeking professional advice or counseling if you're struggling to find a solution on your own."
          ]
     
    },
    {
      
          "tag": "Trivia/Facts",
          "patterns": [
            "Tell me an interesting fact",
            "Give me some trivia",
            "Do you know any fun facts?",
            "Share a random fact",
            "Hit me with a piece of trivia",
            "What's a fascinating fact you know?",
            "I'm a fan of random facts. Share one!"
          ],
          "responses": [
            "Did you know that honey never spoils? Archaeologists have found pots of honey in ancient Egyptian tombs that are over 3,000 years old and still perfectly edible!",
            "Here's an interesting fact: Bananas are berries, but strawberries aren't!",
            "Incredible but true: The total weight of all the ants on Earth is roughly equal to the total weight of all the humans on Earth!",
            "Here's a fun fact: The shortest war in history was between Britain and Zanzibar on August 27, 1896. It lasted only 38 minutes!",
            "Here's a mind-blowing fact: There are more possible iterations of a game of chess than there are atoms in the known universe!",
            "Here's an interesting tidbit: Octopuses have three hearts and blue blood!",
            "Here's a fun fact: The longest time between two twins being born is 87 days!"
          ]
       
    },{
      
          "tag": "Random/Other",
          "patterns": [
            "Surprise me",
            "Tell me something unexpected",
            "I'm feeling adventurous. Give me something random",
            "Got anything interesting to share?",
            "Tell me a random fact",
            "I'm curious about the unknown. Enlighten me!",
            "What's something unique you can tell me?",
            "I'm open to new information. Surprise me!",
            "Feeling adventurous. Give me something different"
          ],
          "responses": [
            "Did you know that the shortest war in history was between Britain and Zanzibar in 1896? It lasted only 38 minutes!",
            "Here's something unexpected: Honey never spoils! Archaeologists have found pots of honey in ancient Egyptian tombs that are over 3,000 years old and still perfectly edible.",
            "Here's a random fact: The total weight of all the ants on Earth is roughly equal to the total weight of all the humans on Earth!",
            "Fun fact: The average person will spend about six months of their life waiting at red lights!",
            "Here's an unusual fact: Cows have best friends and get stressed when they are separated!",
            "Here's a curveball: Honeybees can recognize human faces!",
            "Random fact: The world's largest desert isn't the Sahara? It's actually Antarctica, which is classified as a cold desert due to its low precipitation!",
            "Did you know that the Eiffel Tower can be 15 cm taller during the summer due to thermal expansion of the iron?",
            "Here's something unexpected: Bananas are berries, but strawberries aren't!"
          ]
       
    },
    {
      
          "tag": "Weather",
          "patterns": [
            "What's the weather like today?",
            "Can you tell me the forecast?",
            "I want to know the weather forecast",
            "How's the weather looking?",
            "What's the temperature outside?",
            "Any storms expected?",
            "Do I need an umbrella today?",
            "Is it going to be hot or cold?"
          ],
          "responses": [
            "The current temperature is [Current Temperature]°F/[Current Temperature]°C with [Weather Condition].",
            "Today's forecast calls for [Weather Condition] with a high of [High Temperature]°F/[High Temperature]°C and a low of [Low Temperature]°F/[Low Temperature]°C.",
            "Tomorrow is expected to be [Weather Condition] with a high of [High Temperature]°F/[High Temperature]°C and a low of [Low Temperature]°F/[Low Temperature]°C.",
            "The weekend forecast includes [Weather Condition] on [Saturday/Sunday] with temperatures ranging from [Low Temperature]°F/[Low Temperature]°C to [High Temperature]°F/[High Temperature]°C.",
            "There's a chance of [Type of Precipitation] later today, so you may want to carry an umbrella.",
            "Extreme weather conditions are not expected, but it's always a good idea to stay informed and prepared.",
            "You may want to dress warmly as the temperature is expected to drop throughout the day.",
            "Outdoor activities should be enjoyable with [Weather Condition] and comfortable temperatures."
          ]
        }
    ]
  }
